app/Http/Controllers/Api/LeadController.php

select * from `products` where `year` = '2018' and `make` = 'TVS' and `part_name` = 'Parts' and `model` = 'M5' limit 1
---
    public function createWithToken(Request $request) {
        $validator = \Validator::make(
                $request->all(),
                [
                    'year' => 'required|max:120',
                    'make' => 'required',
                    'model' => 'required',
                    'part_name' => 'required|nullable',
                    'customer_name' => 'required|nullable',
                    'customer_phone' => 'required|nullable',
                ]
        );

        if ($validator->fails()) {
            return response()->json([
                        'status' => 'error',
                        'errors' => $validator->errors(),
                            ], 422);
        }

        try {
            $product = Product::where('year', $request->year)
                    ->where('make', $request->make)
                    ->where('part_name', $request->part_name)
                    ->where('model', $request->model)
                    ->first();

insert into `products` (`part_name`, `year`, `make`, `model`, `updated_at`, `created_at`) values ('Parts', '2018', 'TVS', 'M5', '2025-11-21 10:45:05', '2025-11-21 10:45:05')
---
                $product['year'] = $request->year;
                $product['make'] = $request->make;
                $product['model'] = $request->model;
                $product->save();

insert into `leads` (`date`, `cust_name`, `product_id`, `contact`, `updated_at`, `created_at`) values ('2025-11-21', 'Rahul', 3, 8596748596, '2025-11-21 10:45:05', '2025-11-21 10:45:05')
---
            $lead['product_id'] = $productId;
            $lead['contact'] = $request->customer_phone;
            $product['disposition'] = 0;
            $lead->save();