app/Http/Controllers/LeadController.php

    public function show(Lead $lead) {

        if (\Auth::user()->can('Show Lead')) {
            $status = collect(Lead::$disposition);
            $lead->load('leadType', 'product', 'assign_user');
---
select * from `products` where `products`.`id` in ('')
select * from `users` where `users`.`id` in (10)

    public function update(Request $request, Lead $lead) {
        if (\Auth::user()->can('Edit Lead')) {
            $validator = \Validator::make(
                    $request->all(),
                    [
                        'cust_name' => 'required|max:120',
                        'contact' => 'required|numeric',
                    ]
            );
            if ($validator->fails()) {
                $messages = $validator->getMessageBag();
                return redirect()->back()->with('error', $messages->first());
            }
            try {
                $lead['cust_name'] = $request->cust_name;
                $lead['lead_type_id'] = ($request->lead_type_id && $request->lead_type_id != '0') ? $request->lead_type_id : null;
                $lead['contact'] = $request->contact;
                $lead['product_id'] = $request->product;
                $lead['email'] = $request->email;
                $lead['date'] = $request->date;
                $lead['disposition'] = $request->disposition;
                $lead['note'] = $request->note;
                $lead['user_id'] = \Auth::user()->id;
                $lead->update();

                Stream::create(
                        [
                            'user_id' => \Auth::user()->id,
                            'log_type' => 'updated',
                            'remark' => json_encode(
                                    [
                                        'owner_name' => \Auth::user()->username,
                                        'title' => 'lead',
                                        'stream_comment' => '',
                                        'user_name' => $lead->cust_name,
                                    ]
                            ),
                        ]
                );

                LeadStatuses::create(
                        [
                            'created_by' => \Auth::user()->id,
                            'lead_id' => $lead->id,
                            'lead_status' => $request->disposition
                        ]
                );
---
update `leads` set `product_id` = '', `disposition` = '2', `note` = 'dfgdfgdfg', `leads`.`updated_at` = '2025-11-21 11:50:42' where `id` = 2
insert into `streams` (`user_id`, `log_type`, `remark`, `updated_at`, `created_at`) values (10, 'updated', '{\"owner_name\":\"info@extraaazpos.com\",\"title\":\"lead\",\"stream_comment\":\"\",\"user_name\":\"Rahul\"}', '2025-11-21 11:50:42', '2025-11-21 11:50:42')
insert into `lead_statuses` (`created_by`, `lead_id`, `lead_status`, `followup_note`, `updated_at`, `created_at`) values (10, 2, '2', 'dfgdfgdfg', '2025-11-21 14:02:33', '2025-11-21 14:02:33')

    public function getLeadforNotify() {
        if (\Auth::user()->can('Manage Lead')) {
            $hasLeads = Lead::where('user_id', \Auth::user()->id)
                    ->where('disposition', '!=', 1)
                    ->exists();
            if (!$hasLeads) {
                $lead = Lead::with('product')->where('user_id', NULL)->where('disposition', 0)->first();
---
select exists(select * from `leads` where `user_id` = 10 and `disposition` != 1) as `exists`
select * from `leads` where `user_id` is null and `disposition` = 0 limit 1
select * from `products` where `products`.`id` in (3)

    public function assign_leads($id) {
        if (\Auth::user()->can('Manage Lead')) {
            try {
                $lead = Lead::find($id);
                $lead['user_id'] = \Auth::user()->id;
//            $lead['disposition'] = 1;
                $lead->update();

                LeadStatuses::create(
                        [
                            'created_by' => \Auth::user()->id,
                            'lead_id' => $id,
                            'lead_status' => 0
                        ]
                );
---
select * from `leads` where `leads`.`id` = '2' limit 1
update `leads` set `user_id` = 10, `leads`.`updated_at` = '2025-11-18 11:24:05' where `id` = 2
insert into `lead_statuses` (`created_by`, `lead_id`, `lead_status`, `updated_at`, `created_at`) values (10, '2', 0, '2025-11-21 11:24:42', '2025-11-21 11:24:42')

    public function statusLogs($id) {
        if (\Auth::user()->can('Manage Lead')) {
            $status = collect(Lead::$disposition);
            $logs = LeadStatuses::with('lead', 'creator')->where('lead_id', $id)->get();
---
select * from `lead_statuses` where `lead_id` = '2'
select * from `leads` where `leads`.`id` in (2)