app/Http/Controllers/ProductController.php

    public function getProductDetails(Request $request) {
        $productId = $request->get('product_id');

        if ($productId) {
            $product = Product::find($productId);
---
select * from `products` where `products`.`id` = '1' limit 1