app/Http/Controllers/SalesOrderController.php

select * from `sales_orders` where `sales_orders`.`id` = '1' limit 1
---
    public function update(Request $request, $id) {
        if (\Auth::user()->can('Edit SalesOrder')) {
            $salesOrder = SalesOrder::find($id);

update `sales_orders` set `source_date` = '2025-11-21', `sales_orders`.`updated_at` = '2025-11-21 20:53:43' where `id` = 1
insert into `streams` (`user_id`, `created_by`, `log_type`, `remark`, `updated_at`, `created_at`) values (3, 3, 'updated', '{\"owner_name\":\"shubham@extraaaz.com\",\"title\":\"salesOrder\",\"stream_comment\":\"\",\"user_name\":\"1111\"}', '2025-11-21 20:53:43', '2025-11-21 20:53:43')
---
            $salesOrder['charge_amount'] = $request->charge_amount;
            $salesOrder['total_amount_quoted'] = $request->total_amount_quoted;
            $salesOrder['agent_note'] = $request->agent_note;
            $salesOrder->update();

            Stream::create(
                    [
                        'user_id' => \Auth::user()->id,
                        'created_by' => \Auth::user()->creatorId(),
                        'log_type' => 'updated',
                        'remark' => json_encode(
                                [
                                    'owner_name' => \Auth::user()->username,
                                    'title' => 'salesOrder',
                                    'stream_comment' => '',
                                    'user_name' => $salesOrder->part_number,
                                ]
                        ),
                    ]
            );

select * from `sales_orders` where `sales_orders`.`id` = '1' limit 1
---
    public function createYardLogs(Request $request, $id) {
        $salesOrder = SalesOrder::find($id);

insert into `yards` (`yard_name`, `yard_address`, `yard_email`, `yard_person_name`, `contact`, `created_by`, `updated_at`, `created_at`) values ('USA', 'Usa', 'usadd@gmail.com', 'Ishan', '7777777777', 3, '2025-11-21 21:02:20', '2025-11-21 21:02:20')
---
            $yard->yard_person_name = $request->yard_person_name;
            $yard->contact = $request->contact;
            $yard->created_by = \Auth::user()->id;
            $yard->save();

insert into `yard_logs` (`sales_order_id`, `yard_id`, `comments`, `card_used`, `yard_order_date`, `delivery_date`, `created_by`, `updated_at`, `created_at`) values (1, 3, 'wwrqwerwer', '4234', '2025-10-23', '2025-10-25', 3, '2025-11-21 21:02:20', '2025-11-21 21:02:20')
---
            $yardLog->delivery_date = $request->delivery_date;
            $yardLog->card_used = $request->card_used;
            $yardLog->created_by = \Auth::user()->id;
            $yardLog->save();

select * from `yard_logs` where `yard_logs`.`id` = '3' limit 1
select * from `sales_orders` where `sales_orders`.`id` = 1 limit 1
---
    public function updateYardLogStatus(Request $request, $logId) {
        if (\Auth::user()->can('Edit SalesOrder')) {
            $yardLog = YardLog::find($logId);
            \Log::info('saveYardDetails method called', [
                'user_id' => \Auth::user()->id,
                'sales_order_id' => $yardLog->sales_order_id,
                'request_data' => $request->all()
            ]);

            $salesOrder = SalesOrder::find($yardLog->sales_order_id);