app/Http/Controllers/YardController.php

    public function search(Request $request)
    {
        $search = $request->get('search', '');
        $limit = $request->get('limit', null);

        $query = Yard::where('yard_name', 'like', '%' . $search . '%');
//            ->orWhere('yard_address', 'like', '%' . $search . '%');

        if ($limit) {
            $yards = $query->limit($limit)->get(['id', 'yard_name', 'yard_address', 'contact', 'yard_email']);
        } else {
            $yards = $query->get(['id', 'yard_name', 'yard_address', 'contact', 'yard_email']);
---
select `id`, `yard_name`, `yard_address`, `contact`, `yard_email` from `yards` where `yard_name` like '%0%' or `yard_address` like '%0%' limit 5
select `id`, `yard_name`, `yard_address`, `contact`, `yard_email` from `yards` where `yard_name` like '%%' or `yard_address` like '%%'