app/Models/Lead.php

    public function fetchgetAccountNameAttribute() {
        $account = Lead::find($this->account);
---
select * from `leads` where `leads`.`id` is null limit 1

    public function fetchgetCampaignNameAttribute() {
        $campaign = Lead::find($this->campaign);
---
select * from `leads` where `leads`.`id` is null limit 1

    public function getSourceNameAttribute() {
        $lead_source = Lead::find($this->source);
---
select * from `leads` where `leads`.`id` is null limit 1