app/Models/User.php

    public function getUserRolesNameAttribute() {
        $user_roles = User::find($this->user_roles);
---
select * from `users` where `users`.`id` = '3' limit 1