app/Models/Utility.php

    public static function fetchSettings() {
        $data = DB::table('settings');

        if (\Auth::check()) {
            $data = $data->where('created_by', '=', \Auth::user()->creatorId())->get();
            if (count($data) == 0) {
                $data = DB::table('settings')->where('created_by', '=', 1)->get();
            }
        } else {
            $data->where('created_by', '=', 1);
            $data = $data->get();
---
select * from `settings` where `created_by` = 3
select * from `settings` where `created_by` = 1

    public static function addNewData() {
        \Artisan::call('cache:forget spatie.permission.cache');
        \Artisan::call('cache:clear');
        $usr = \Auth::user();
        $arrPermissions = [
            'Manage Form Builder',
            'Create Form Builder',
            'Edit Form Builder',
            'Delete Form Builder',
            'Show Form Builder',
            'Manage Form Field',
            'Create Form Field',
            'Edit Form Field',
            'Delete Form Field',
            'Manage Payment',
            'Create Payment',
            'Edit Payment',
            'Delete Payment',
            'Manage Invoice Payment',
            'Create Invoice Payment',
        ];
        foreach ($arrPermissions as $ap) {
            // check if permission is not created then create it.
            $permission = Permission::where('name', 'LIKE', $ap)->first();
            if (empty($permission)) {
                Permission::create(['name' => $ap]);
            }
        }

        $ownerRole = Role::where('name', 'LIKE', 'Owner')->where('created_by', '=', $usr->createId())->first();
---
select * from `permissions` where `name` LIKE 'Manage Form Builder' limit 1
select * from `roles` where `name` LIKE 'Owner' and `created_by` = 1 limit 1